tests/performance/cloud-storage-test.yaml
config:
  target: "https://storage.googleapis.com"
  phases:
    # Test GCS access performance
    - name: "GCS Access Test"
      duration: 60
      arrivalRate: 5
    - name: "GCS Sustained Load"
      duration: 60
      arrivalRate: 10
  engines:
    http:
      timeout: 30
  plugins:
    expect: {}

scenarios:
  - name: "Fetch Manifest"
    weight: 40
    flow:
      - get:
          url: "/minimoonoir-vectors/manifest.json"
          expect:
            - statusCode: 200
            - contentType: json
          capture:
            - json: "$.version"
              as: "version"
            - json: "$.timestamp"
              as: "timestamp"

  - name: "Check Index Existence"
    weight: 30
    flow:
      - head:
          url: "/minimoonoir-vectors/index.bin"
          expect:
            - statusCode:
                - 200
                - 404

  - name: "Fetch Manifest Metadata"
    weight: 30
    flow:
      - get:
          url: "/minimoonoir-vectors/manifest.json"
          expect:
            - statusCode: 200
      - think: 2