tests/performance/embedding-api-load-test.yaml
config:
  target: "https://embedding-api-617806532906.us-central1.run.app"
  phases:
    # Cold start test - single request
    - name: "Cold Start"
      duration: 10
      arrivalRate: 1
      pause: 5
    # Warm-up phase - gradually increase load
    - name: "Warm-up"
      duration: 30
      arrivalRate: 1
      rampTo: 5
    # Sustained load - 10 concurrent requests
    - name: "Sustained Load"
      duration: 60
      arrivalRate: 10
    # Spike test - burst load
    - name: "Spike Test"
      duration: 30
      arrivalRate: 20
  engines:
    http:
      timeout: 60
  plugins:
    expect: {}
    metrics-by-endpoint:
      stripQueryString: true

scenarios:
  - name: "Health Check"
    weight: 10
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: status

  - name: "Single Text Embedding (Short)"
    weight: 30
    flow:
      - post:
          url: "/embed"
          json:
            text: "Hello world"
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: embeddings
            - hasProperty: dimensions
          capture:
            - json: "$.dimensions"
              as: "dimensions"
      - think: 1

  - name: "Single Text Embedding (Medium)"
    weight: 30
    flow:
      - post:
          url: "/embed"
          json:
            text: "This is a longer test message that contains more words and should take slightly longer to process. We're testing the embedding API performance with realistic message lengths that users might actually send in a chat application."
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: embeddings

  - name: "Single Text Embedding (Long)"
    weight: 20
    flow:
      - post:
          url: "/embed"
          json:
            text: "This is an even longer message that simulates a user writing a detailed post or comment with multiple sentences and paragraphs. We want to understand how the API performs when users submit longer content, which might happen in forum posts, detailed discussions, or comprehensive event descriptions. The performance characteristics of embedding generation typically scale with input length, so testing with various text sizes helps us understand the full performance profile of the system. Additional content for testing performance under realistic load conditions with extended text inputs."
          expect:
            - statusCode: 200

  - name: "Batch Text Embedding"
    weight: 10
    flow:
      - post:
          url: "/embed"
          json:
            text:
              - "First message"
              - "Second message"
              - "Third message"
              - "Fourth message"
              - "Fifth message"
          expect:
            - statusCode: 200
            - contentType: json