tests/performance/nostr-relay-websocket-test.yaml
config:
  target: "wss://nostr-relay-617806532906.us-central1.run.app"
  phases:
    # Connection establishment test
    - name: "Connection Test"
      duration: 30
      arrivalRate: 2
    # Sustained WebSocket load
    - name: "Sustained Load"
      duration: 60
      arrivalRate: 5
    # High concurrency test
    - name: "High Concurrency"
      duration: 30
      arrivalRate: 10
  engines:
    ws:
      timeout: 30
  plugins:
    expect: {}

scenarios:
  - name: "WebSocket Connection Lifecycle"
    engine: ws
    flow:
      # Connect to relay
      - connect:
          url: "/"

      # Request relay info (NIP-11 via WebSocket polyfill)
      - send:
          payload: '["REQ", "test-001", {"kinds": [0], "limit": 1}]'

      # Wait for response
      - think: 2

      # Send close subscription
      - send:
          payload: '["CLOSE", "test-001"]'

      # Keep connection open briefly
      - think: 1

  - name: "Subscribe to Events"
    engine: ws
    flow:
      - connect:
          url: "/"

      # Subscribe to kind 1 events (text notes)
      - send:
          payload: '["REQ", "sub-002", {"kinds": [1], "limit": 10}]'

      # Wait for event stream
      - think: 5

      # Close subscription
      - send:
          payload: '["CLOSE", "sub-002"]'

  - name: "Publish Event Test"
    engine: ws
    flow:
      - connect:
          url: "/"

      # Note: This is a mock event structure for testing
      # Real implementation would require proper signing
      - send:
          payload: '["EVENT", {"kind": 1, "content": "test", "tags": [], "created_at": 1702857600}]'

      - think: 1

  - name: "Long-lived Connection"
    engine: ws
    flow:
      - connect:
          url: "/"

      - send:
          payload: '["REQ", "persistent-003", {"kinds": [1, 40, 41, 42], "limit": 20}]'

      # Simulate long-lived subscription
      - think: 10

      - send:
          payload: '["CLOSE", "persistent-003"]'